INSERT INTO Product_categories (product_id, category_id) VALUES
(1, 6),   -- Гречка              → Крупы
(2, 6),   -- Рис белый           → Крупы
(3, 2),   -- Куриная грудка      → Мясо и яйца
(4, 2),   -- Яйцо куриное        → Мясо и яйца
(5, 1),   -- Творог 5%           → Молочные продукты
(6, 5),   -- Банан               → Фрукты и ягоды
(6, 10),   -- Банан               → Сладкое
(7, 5),   -- Яблоко              → Фрукты и ягоды
(8, 4),   -- Огурец              → Овощи и зелень
(9, 4),   -- Помидор             → Овощи и зелень
(10, 7),  -- Хлеб цельнозерновой → Выпечка
(11, 6),  -- Овсянка             → Крупы
(12, 3),  -- Лосось              → Рыба
(13, 3),  -- Тунец консервы      → Рыба
(14, 1),  -- Сыр Российский      → Молочные продукты
(15, 1),  -- Молоко 2.5%         → Молочные продукты
(16, 8),  -- Кофе чёрный         → Напитки
(17, 8),  -- Чай зелёный         → Напитки
(18, 10), -- Мёд                 → Сладкое
(19, 9),  -- Орехи грецкие       → Орехи и семена
(20, 5);  -- Авокадо             → Фрукты и ягоды