INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 1, 1, 11, 80), (1, 1, 1, 4, 110), (1, 1, 1, 15, 200),   -- Завтрак: Овсянка+Яйцо+Молоко
(1, 1, 4, 7, 150), (1, 1, 4, 19, 30),                        -- Перекус: Яблоко+Орехи
(1, 1, 2, 1, 100), (1, 1, 2, 3, 130), (1, 1, 2, 8, 100),    -- Обед: Гречка+Курица+Огурец
(1, 1, 3, 2, 80), (1, 1, 3, 12, 120), (1, 1, 3, 9, 150);    -- Ужин: Рис+Лосось+Помидор

-- Расписание Плана 2
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 1, 1, 5, 150), (2, 1, 1, 10, 40),                        -- Завтрак: Творог+Хлеб
(2, 1, 4, 8, 200),                                            -- Перекус: Огурец
(2, 1, 2, 1, 80), (2, 1, 2, 3, 100), (2, 1, 2, 9, 150),     -- Обед: Гречка+Курица+Помидор
(2, 1, 3, 4, 110), (2, 1, 3, 8, 150), (2, 1, 3, 7, 100);    -- Ужин: Яйцо+Огурец+Яблоко

-- Расписание Плана 3
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 1, 1, 11, 100), (3, 1, 1, 6, 150), (3, 1, 1, 15, 250),  -- Завтрак: Овсянка+Банан+Молоко
(3, 1, 4, 19, 50), (3, 1, 4, 18, 30),                        -- Перекус: Орехи+Мёд
(3, 1, 2, 2, 120), (3, 1, 2, 3, 180), (3, 1, 2, 10, 60),    -- Обед: Рис+Курица+Хлеб
(3, 1, 3, 1, 120), (3, 1, 3, 13, 150), (3, 1, 3, 20, 100); 
-- ==========================================
-- ПЛАН 1: Сбалансированный (~1800 ккал)
-- ==========================================
-- День 2
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 2, 1, 5, 150), (1, 2, 1, 10, 40), (1, 2, 1, 16, 1),
(1, 2, 4, 6, 120), (1, 2, 4, 19, 20),
(1, 2, 2, 2, 90), (1, 2, 2, 3, 140), (1, 2, 2, 8, 120),
(1, 2, 3, 1, 80), (1, 2, 3, 12, 100), (1, 2, 3, 9, 100);

-- День 3
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 3, 1, 11, 70), (1, 3, 1, 15, 200), (1, 3, 1, 18, 20),
(1, 3, 4, 7, 150), (1, 3, 4, 14, 30),
(1, 3, 2, 1, 90), (1, 3, 2, 3, 120), (1, 3, 2, 8, 100),
(1, 3, 3, 2, 90), (1, 3, 3, 13, 140), (1, 3, 3, 9, 120);

-- День 4
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 4, 1, 4, 220), (1, 4, 1, 10, 40),
(1, 4, 4, 6, 100), (1, 4, 4, 17, 1),
(1, 4, 2, 2, 100), (1, 4, 2, 3, 150), (1, 4, 2, 20, 50),
(1, 4, 3, 1, 80), (1, 4, 3, 12, 100), (1, 4, 3, 8, 100);

-- День 5
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 5, 1, 5, 180), (1, 5, 1, 10, 50), (1, 5, 1, 16, 1),
(1, 5, 4, 7, 120), (1, 5, 4, 19, 25),
(1, 5, 2, 1, 100), (1, 5, 2, 3, 130), (1, 5, 2, 9, 150),
(1, 5, 3, 11, 80), (1, 5, 3, 13, 130), (1, 5, 3, 8, 100);

-- День 6
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 6, 1, 11, 80), (1, 6, 1, 4, 110), (1, 6, 1, 15, 150),
(1, 6, 4, 6, 150), (1, 6, 4, 18, 15),
(1, 6, 2, 2, 100), (1, 6, 2, 3, 140), (1, 6, 2, 20, 60),
(1, 6, 3, 1, 90), (1, 6, 3, 12, 110), (1, 6, 3, 9, 120);

-- День 7
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(1, 7, 1, 5, 150), (1, 7, 1, 7, 100), (1, 7, 1, 17, 1),
(1, 7, 4, 8, 200), (1, 7, 4, 14, 25),
(1, 7, 2, 1, 100), (1, 7, 2, 3, 150), (1, 7, 2, 8, 100),
(1, 7, 3, 2, 90), (1, 7, 3, 13, 150), (1, 7, 3, 20, 50);


-- ==========================================
-- ПЛАН 2: Лёгкий дефицит (~1500 ккал)
-- ==========================================
-- День 2
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 2, 1, 11, 60), (2, 2, 1, 4, 110), (2, 2, 1, 17, 1),
(2, 2, 4, 7, 120),
(2, 2, 2, 1, 70), (2, 2, 2, 3, 120), (2, 2, 2, 8, 150),
(2, 2, 3, 5, 140), (2, 2, 3, 9, 120);

-- День 3
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 3, 1, 5, 160), (2, 3, 1, 10, 30), (2, 3, 1, 16, 1),
(2, 3, 4, 8, 200), (2, 3, 4, 14, 20),
(2, 3, 2, 2, 70), (2, 3, 2, 3, 130), (2, 3, 2, 9, 150),
(2, 3, 3, 1, 70), (2, 3, 3, 12, 90), (2, 3, 3, 8, 120);

-- День 4
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 4, 1, 11, 60), (2, 4, 1, 15, 150), (2, 4, 1, 18, 10),
(2, 4, 4, 6, 100),
(2, 4, 2, 1, 80), (2, 4, 2, 3, 110), (2, 4, 2, 8, 100),
(2, 4, 3, 2, 60), (2, 4, 3, 13, 120), (2, 4, 3, 9, 100);

-- День 5
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 5, 1, 4, 220), (2, 5, 1, 10, 30),
(2, 5, 4, 7, 100), (2, 5, 4, 19, 15),
(2, 5, 2, 2, 70), (2, 5, 2, 3, 140), (2, 5, 2, 9, 150),
(2, 5, 3, 5, 150), (2, 5, 3, 8, 150);

-- День 6
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 6, 1, 5, 150), (2, 6, 1, 16, 1),
(2, 6, 4, 8, 200), (2, 6, 4, 14, 25),
(2, 6, 2, 1, 70), (2, 6, 2, 3, 120), (2, 6, 2, 8, 120),
(2, 6, 3, 11, 60), (2, 6, 3, 12, 90), (2, 6, 3, 9, 100);

-- День 7
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(2, 7, 1, 11, 70), (2, 7, 1, 4, 110), (2, 7, 1, 17, 1),
(2, 7, 4, 6, 100), (2, 7, 4, 18, 10),
(2, 7, 2, 2, 60), (2, 7, 2, 3, 130), (2, 7, 2, 9, 150),
(2, 7, 3, 1, 60), (2, 7, 3, 13, 130), (2, 7, 3, 8, 150);


-- ==========================================
-- ПЛАН 3: Набор массы (~2200 ккал)
-- ==========================================
-- День 2
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 2, 1, 11, 100), (3, 2, 1, 4, 220), (3, 2, 1, 15, 250), (3, 2, 1, 18, 20),
(3, 2, 4, 6, 150), (3, 2, 4, 19, 40),
(3, 2, 2, 2, 130), (3, 2, 2, 3, 180), (3, 2, 2, 20, 60),
(3, 2, 3, 1, 120), (3, 2, 3, 12, 130), (3, 2, 3, 9, 150);

-- День 3
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 3, 1, 5, 200), (3, 3, 1, 10, 60), (3, 3, 1, 16, 1),
(3, 3, 4, 7, 150), (3, 3, 4, 18, 25), (3, 3, 4, 19, 30),
(3, 3, 2, 1, 110), (3, 3, 2, 3, 200), (3, 3, 2, 8, 120),
(3, 3, 3, 2, 100), (3, 3, 3, 13, 160), (3, 3, 3, 20, 70);

-- День 4
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 4, 1, 11, 110), (3, 4, 1, 6, 150), (3, 4, 1, 15, 200),
(3, 4, 4, 8, 200), (3, 4, 4, 14, 40),
(3, 4, 2, 2, 140), (3, 4, 2, 3, 190), (3, 4, 2, 10, 70),
(3, 4, 3, 1, 130), (3, 4, 3, 12, 140), (3, 4, 3, 9, 150);

-- День 5
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 5, 1, 4, 220), (3, 5, 1, 10, 50), (3, 5, 1, 15, 200),
(3, 5, 4, 6, 130), (3, 5, 4, 19, 45),
(3, 5, 2, 1, 120), (3, 5, 2, 3, 180), (3, 5, 2, 20, 60),
(3, 5, 3, 2, 110), (3, 5, 3, 13, 170), (3, 5, 3, 8, 120);

-- День 6
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 6, 1, 5, 180), (3, 6, 1, 7, 120), (3, 6, 1, 17, 1),
(3, 6, 4, 18, 20), (3, 6, 4, 19, 40), (3, 6, 4, 6, 100),
(3, 6, 2, 2, 130), (3, 6, 2, 3, 170), (3, 6, 2, 9, 150),
(3, 6, 3, 1, 120), (3, 6, 3, 12, 150), (3, 6, 3, 20, 80);

-- День 7
INSERT INTO Plan_Schedule (plan_id, day_index, meal_type_id, product_id, recommended_weight_g) VALUES
(3, 7, 1, 11, 100), (3, 7, 1, 15, 250), (3, 7, 1, 18, 25),
(3, 7, 4, 7, 150), (3, 7, 4, 14, 35),
(3, 7, 2, 1, 110), (3, 7, 2, 3, 190), (3, 7, 2, 8, 100),
(3, 7, 3, 2, 100), (3, 7, 3, 13, 160), (3, 7, 3, 9, 150);